app/controllers/sections_controller.rb

  def edit
    @contents = Content.where(section_id: @section.id)
---
SELECT "contents".* FROM "contents" WHERE "contents"."section_id" = ?  [["section_id", 1]]